#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=3404aa547881f97317129b17cb69145b8163b35bb5724b79ecdb3a8995194c10]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=pLFebfNjtyI]
module.ubunturoutervm.random_id.randomid_pip: Refreshing state... [id=Kxyn9A]
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=ZNVk0IU1xBY]
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2888806183]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=T3clQZPSW6A]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
azurerm_virtual_network.vnet_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001]
azurerm_network_security_group.nsg-router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg-router]
module.ubuntuspoke2.random_id.randomId: Refreshing state... [id=UIM0MWMlr_s]
module.ubuntuspoke1.random_id.randomId: Refreshing state... [id=oGQ8ee0cQW0]
module.ubunturoutervm.random_id.randomId: Refreshing state... [id=fSec9leN-WU]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
module.ubunturoutervm.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diag7d279cf6578df965]
module.ubuntuspoke1.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diaga0643c79ed1c416d]
module.ubuntuspoke2.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diag508334316325affb]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
module.spoke2network.azurerm_subnet.subnet-spoke[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
azurerm_subnet.subnet_hub[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/subnets/RouterSubnet]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet.subnet-spoke[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet.subnet-spoke[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-4f77254193d25ba0]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-2b1ca7f4]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-64d564d08535c416]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
module.ubunturoutervm.azurerm_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet_network_security_group_association.nsg-router-association will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg-router-association" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg-router"
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/subnets/RouterSubnet"
    }

  # module.spoke1network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vnet-spoke1-001-hub"
      + remote_virtual_network_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001"
      + resource_group_name          = "rg-spoke1-001"
      + use_remote_gateways          = true
      + virtual_network_name         = "vnet-spoke1-001"
    }

  # module.spoke2network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vnet-spoke2-001-hub"
      + remote_virtual_network_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001"
      + resource_group_name          = "rg-spoke2-001"
      + use_remote_gateways          = true
      + virtual_network_name         = "vnet-spoke2-001"
    }

  # module.ubuntuspoke1.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke1-dev-001"
      + network_interface_ids            = [
          + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-64d564d08535c416",
        ]
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://diaga0643c79ed1c416d.blob.core.windows.net/"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke1-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubuntuspoke2.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke2-dev-001"
      + network_interface_ids            = [
          + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-4f77254193d25ba0",
        ]
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://diag508334316325affb.blob.core.windows.net/"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke2-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Validate and Plan on PR`*